#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_caller_identity.current: Reading...
data.aws_ssm_parameter.infra_output: Reading...
data.aws_iam_policy_document.assume_by_codedeploy: Reading...
aws_codedeploy_app.application_main: Refreshing state... [id=b326775b-2c4f-418c-afe6-c643eafbbc4b:app-6]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=app-6-task-execution-role]
data.aws_iam_policy_document.assume_by_codedeploy: Read complete after 0s [id=4250039221]
aws_iam_role.codedeploy: Refreshing state... [id=app-6-code-deploy-role]
data.aws_caller_identity.current: Read complete after 0s [id=743794601996]
aws_iam_role.ecs_task_role: Refreshing state... [id=app-6-task-role]
data.aws_ssm_parameter.infra_output: Read complete after 0s [id=/app-6/output]
aws_iam_policy.secrets_manager_read_policy: Refreshing state... [id=arn:aws:iam::743794601996:policy/app-6-ecs-fargate-secrets-manager-access]
aws_iam_role_policy_attachment.custom: Refreshing state... [id=app-6-task-execution-role-20241003153209502800000001]
data.aws_iam_policy_document.codedeploy: Reading...
data.aws_iam_policy_document.codedeploy: Read complete after 0s [id=1211725747]
aws_iam_role_policy_attachment.attach_secrets_read_task_execution_role: Refreshing state... [id=app-6-task-execution-role-20241003153209508300000002]
aws_iam_role_policy_attachment.attach_secrets_read_task_role: Refreshing state... [id=app-6-task-role-20241003153209524100000003]
aws_ecs_task_definition.web_app: Refreshing state... [id=app-6]
aws_iam_role_policy.codedeploy: Refreshing state... [id=app-6-code-deploy-role:terraform-20241003165455650800000001]
aws_ecs_service.service: Refreshing state... [id=arn:aws:ecs:us-east-2:743794601996:service/app-6/app-6]
aws_codedeploy_deployment_group.application_main: Refreshing state... [id=664c9ff4-b726-4afb-9654-85030ab22491]
local_file.code_deploy_sh: Refreshing state... [id=93ae47b68560241e8b150bae4fdad0a4ffd826fe]
terraform_data.code_deploy: Refreshing state... [id=c9cc7873-cee6-f345-1f1b-6f4c38b582a9]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # local_file.code_deploy_sh has been deleted
  - resource "local_file" "code_deploy_sh" {
      - content              = <<-EOT
            #!/bin/bash
            echo "Starting CodeDeploy agent deployment"
            aws --version
            DEPLOYMENT_INFO=$(aws deploy create-deployment \
                --application-name app-6 \
                --deployment-config-name CodeDeployDefault.OneAtATime \
                --deployment-group-name app-6-deploy-group \
                --revision '{"revisionType":"AppSpecContent","appSpecContent":{"content":"'{\"Resources\":[{\"TargetService\":{\"Properties\":{\"LoadBalancerInfo\":{\"ContainerName\":\"first\",\"ContainerPort\":8080},\"TaskDefinition\":\"arn:aws:ecs:us-east-2:743794601996:task-definition/app-6:37\"},\"Type\":\"AWS::ECS::Service\"}}],\"version\":0}'","sha256":"'38c3116d92092fd0e3d6097fdb615b821f074cffe31d6f76e65ccf160fc510d9'"}}' \
                --description "Deployment from Terraform" \
                --output json)
            ID=$(echo $DEPLOYMENT_INFO | jq -r '.deploymentId')
            STATUS=$(echo $DEPLOYMENT_INFO | jq -r '.deploymentInfo.status')
            echo "waiting for deployment to complete"
            STATUS=$(aws deploy get-deployment \
              --deployment-id "$ID" \
              --output json | jq -r '.deploymentInfo.status')
            
            while [ "$STATUS" == "Created" ] || [ "$STATUS" == "InProgress" ] || [ "$STATUS" == "Pending" ] || [ "$STATUS" == "Queued" ] || [ "$STATUS" == "Ready" ]; do
                echo "Deployment status: $STATUS"
                STATUS=$(aws deploy get-deployment \
                    --deployment-id "$ID" \
                    --output json | jq -r '.deploymentInfo.status')
                echo "waiting for 30 seconds."
                sleep 30
            done
            
            if [ "$STATUS" == "Succeeded" ]; then
                echo "Deployment $ID succeeded"
            else
                echo "Deployment $ID failed"
                exit 1
            fi
        EOT -> null
      - content_base64sha256 = "LGWU+HZf42+xqLYjsc7llSTahgsSA8999ELpx9kUa30=" -> null
      - content_base64sha512 = "50q+FxE6bi6+Q6zVWVwjnHPT9wvdzwj+qK5iAKUtPNhxgx+ZizXncvux4eo6gtdhJwdIQxcJJSFg4aUET9iQsQ==" -> null
      - content_md5          = "1419145c7953414cbd1ca7d9310121bd" -> null
      - content_sha1         = "93ae47b68560241e8b150bae4fdad0a4ffd826fe" -> null
      - content_sha256       = "2c6594f8765fe36fb1a8b623b1cee59524da860b1203cf7df442e9c7d9146b7d" -> null
      - content_sha512       = "e74abe17113a6e2ebe43acd5595c239c73d3f70bddcf08fea8ae6200a52d3cd871831f998b35e772fbb1e1ea3a82d761270748431709252160e1a5044fd890b1" -> null
      - directory_permission = "0777" -> null
      - file_permission      = "0777" -> null
      - filename             = "./code_deploy.sh" -> null
      - id                   = "93ae47b68560241e8b150bae4fdad0a4ffd826fe" -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_task_definition.web_app must be replaced
-/+ resource "aws_ecs_task_definition" "web_app" {
      ~ arn                      = "arn:aws:ecs:us-east-2:743794601996:task-definition/app-6:37" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-2:743794601996:task-definition/app-6" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "app-6" -> (known after apply)
      ~ revision                 = 37 -> (known after apply)
      - tags                     = {} -> null
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # local_file.code_deploy_sh will be created
  + resource "local_file" "code_deploy_sh" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./code_deploy.sh"
      + id                   = (known after apply)
    }

  # terraform_data.code_deploy is tainted, so must be replaced
-/+ resource "terraform_data" "code_deploy" {
      ~ id               = "c9cc7873-cee6-f345-1f1b-6f4c38b582a9" -> (known after apply)
      ~ input            = "38c3116d92092fd0e3d6097fdb615b821f074cffe31d6f76e65ccf160fc510d9" -> (known after apply)
      ~ output           = "38c3116d92092fd0e3d6097fdb615b821f074cffe31d6f76e65ccf160fc510d9" -> (known after apply)
      ~ triggers_replace = {
          ~ content              = <<-EOT
                #!/bin/bash
                echo "Starting CodeDeploy agent deployment"
                aws --version
                DEPLOYMENT_INFO=$(aws deploy create-deployment \
                    --application-name app-6 \
                    --deployment-config-name CodeDeployDefault.OneAtATime \
                    --deployment-group-name app-6-deploy-group \
                    --revision '{"revisionType":"AppSpecContent","appSpecContent":{"content":"'{\"Resources\":[{\"TargetService\":{\"Properties\":{\"LoadBalancerInfo\":{\"ContainerName\":\"first\",\"ContainerPort\":8080},\"TaskDefinition\":\"arn:aws:ecs:us-east-2:743794601996:task-definition/app-6:37\"},\"Type\":\"AWS::ECS::Service\"}}],\"version\":0}'","sha256":"'38c3116d92092fd0e3d6097fdb615b821f074cffe31d6f76e65ccf160fc510d9'"}}' \
                    --description "Deployment from Terraform" \
                    --output json)
                ID=$(echo $DEPLOYMENT_INFO | jq -r '.deploymentId')
                STATUS=$(echo $DEPLOYMENT_INFO | jq -r '.deploymentInfo.status')
                echo "waiting for deployment to complete"
                STATUS=$(aws deploy get-deployment \
                  --deployment-id "$ID" \
                  --output json | jq -r '.deploymentInfo.status')
                
                while [ "$STATUS" == "Created" ] || [ "$STATUS" == "InProgress" ] || [ "$STATUS" == "Pending" ] || [ "$STATUS" == "Queued" ] || [ "$STATUS" == "Ready" ]; do
                    echo "Deployment status: $STATUS"
                    STATUS=$(aws deploy get-deployment \
                        --deployment-id "$ID" \
                        --output json | jq -r '.deploymentInfo.status')
                    echo "waiting for 30 seconds."
                    sleep 30
                done
                
                if [ "$STATUS" == "Succeeded" ]; then
                    echo "Deployment $ID succeeded"
                else
                    echo "Deployment $ID failed"
                    exit 1
                fi
            EOT -> (known after apply)
          ~ content_base64sha256 = "LGWU+HZf42+xqLYjsc7llSTahgsSA8999ELpx9kUa30=" -> (known after apply)
          ~ content_base64sha512 = "50q+FxE6bi6+Q6zVWVwjnHPT9wvdzwj+qK5iAKUtPNhxgx+ZizXncvux4eo6gtdhJwdIQxcJJSFg4aUET9iQsQ==" -> (known after apply)
          ~ content_md5          = "1419145c7953414cbd1ca7d9310121bd" -> (known after apply)
          ~ content_sha1         = "93ae47b68560241e8b150bae4fdad0a4ffd826fe" -> (known after apply)
          ~ content_sha256       = "2c6594f8765fe36fb1a8b623b1cee59524da860b1203cf7df442e9c7d9146b7d" -> (known after apply)
          ~ content_sha512       = "e74abe17113a6e2ebe43acd5595c239c73d3f70bddcf08fea8ae6200a52d3cd871831f998b35e772fbb1e1ea3a82d761270748431709252160e1a5044fd890b1" -> (known after apply)
          ~ id                   = "93ae47b68560241e8b150bae4fdad0a4ffd826fe" -> (known after apply)
            # (6 unchanged attributes hidden)
        }
    }

Plan: 3 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: TFplan.JSON

To perform exactly these actions, run the following command to apply:
    terraform apply "TFplan.JSON"

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*